Revit 2024 API
LabelUtils.GetLabelForDiscipline Method
 Gets the user-visible name for a discipline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static string GetLabelForDiscipline(
	ForgeTypeId disciplineTypeId
)
Visual Basic
Public Shared Function GetLabelForDiscipline ( _
	disciplineTypeId As ForgeTypeId _
) As String
Visual C++
public:
static String^ GetLabelForDiscipline(
	ForgeTypeId^ disciplineTypeId
)
Parameters
disciplineTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the discipline.
Remarks
 The name is obtained in the current Revit language.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Discipline must have a definition.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
LabelUtils Class
Autodesk.Revit.DB Namespace